[{"title": "Computer Science", "children": [{"title": "Computer Science", "id": "Computer Science", "children": [{"title": "Artificial Intelligence", "id": "cs.AI", "description": "Covers all areas of AI except Vision, Robotics, Machine Learning, Multiagent Systems, and Computation and Language (Natural Language Processing), which have separate subject areas. In particular, includes Expert Systems, Theorem Proving (although this may overlap with Logic in Computer Science), Knowledge Representation, Planning, and Uncertainty in AI. Roughly includes material in ACM Subject Classes I.2.0, I.2.1, I.2.3, I.2.4, I.2.8, and I.2.11.", "key": "1", "isLeaf": true, "level": 2}, {"title": "Hardware Architecture", "id": "cs.AR", "description": "Covers systems organization and hardware architecture. Roughly includes material in ACM Subject Classes C.0, C.1, and C.5.", "key": "2", "isLeaf": true, "level": 2}, {"title": "Computational Complexity", "id": "cs.CC", "description": "Covers models of computation, complexity classes, structural complexity, complexity tradeoffs, upper and lower bounds. Roughly includes material in ACM Subject Classes F.1 (computation by abstract devices), F.2.3 (tradeoffs among complexity measures), and F.4.3 (formal languages), although some material in formal languages may be more appropriate for Logic in Computer Science. Some material in F.2.1 and F.2.2, may also be appropriate here, but is more likely to have Data Structures and Algorithms as the primary subject area.", "key": "3", "isLeaf": true, "level": 2}, {"title": "Computational Engineering, Finance, and Science", "id": "cs.CE", "description": "Covers applications of computer science to the mathematical modeling of complex systems in the fields of science, engineering, and finance. Papers here are interdisciplinary and applications-oriented, focusing on techniques and tools that enable challenging computational simulations to be performed, for which the use of supercomputers or distributed computing platforms is often required. Includes material in ACM Subject Classes J.2, J.3, and J.4 (economics).", "key": "4", "isLeaf": true, "level": 2}, {"title": "Computational Geometry", "id": "cs.CG", "description": "Roughly includes material in ACM Subject Classes I.3.5 and F.2.2.", "key": "5", "isLeaf": true, "level": 2}, {"title": "Computation and Language", "id": "cs.CL", "description": "Covers natural language processing. Roughly includes material in ACM Subject Class I.2.7. Note that work on artificial languages (programming languages, logics, formal systems) that does not explicitly address natural-language issues broadly construed (natural-language processing, computational linguistics, speech, text retrieval, etc.) is not appropriate for this area.", "key": "6", "isLeaf": true, "level": 2}, {"title": "Cryptography and Security", "id": "cs.CR", "description": "Covers all areas of cryptography and security including authentication, public key cryptosytems, proof-carrying code, etc. Roughly includes material in ACM Subject Classes D.4.6 and E.3.", "key": "7", "isLeaf": true, "level": 2}, {"title": "Computer Vision and Pattern Recognition", "id": "cs.CV", "description": "Covers image processing, computer vision, pattern recognition, and scene understanding. Roughly includes material in ACM Subject Classes I.2.10, I.4, and I.5.", "key": "8", "isLeaf": true, "level": 2}, {"title": "Computers and Society", "id": "cs.CY", "description": "Covers impact of computers on society, computer ethics, information technology and public policy, legal aspects of computing, computers and education. Roughly includes material in ACM Subject Classes K.0, K.2, K.3, K.4, K.5, and K.7.", "key": "9", "isLeaf": true, "level": 2}, {"title": "Databases", "id": "cs.DB", "description": "Covers database management, datamining, and data processing. Roughly includes material in ACM Subject Classes E.2, E.5, H.0, H.2, and J.1.", "key": "10", "isLeaf": true, "level": 2}, {"title": "Distributed, Parallel, and Cluster Computing", "id": "cs.DC", "description": "Covers fault-tolerance, distributed algorithms, stabilility, parallel computation, and cluster computing. Roughly includes material in ACM Subject Classes C.1.2, C.1.4, C.2.4, D.1.3, D.4.5, D.4.7, E.1.", "key": "11", "isLeaf": true, "level": 2}, {"title": "Digital Libraries", "id": "cs.DL", "description": "Covers all aspects of the digital library design and document and text creation. Note that there will be some overlap with Information Retrieval (which is a separate subject area). Roughly includes material in ACM Subject Classes H.3.5, H.3.6, H.3.7, I.7.", "key": "12", "isLeaf": true, "level": 2}, {"title": "Discrete Mathematics", "id": "cs.DM", "description": "Covers combinatorics, graph theory, applications of probability. Roughly includes material in ACM Subject Classes G.2 and G.3.", "key": "13", "isLeaf": true, "level": 2}, {"title": "Data Structures and Algorithms", "id": "cs.DS", "description": "Covers data structures and analysis of algorithms. Roughly includes material in ACM Subject Classes E.1, E.2, F.2.1, and F.2.2.", "key": "14", "isLeaf": true, "level": 2}, {"title": "Emerging Technologies", "id": "cs.ET", "description": "Covers approaches to information processing (computing, communication, sensing) and bio-chemical analysis based on alternatives to silicon CMOS-based technologies, such as nanoscale electronic, photonic, spin-based, superconducting, mechanical, bio-chemical and quantum technologies (this list is not exclusive). Topics of interest include (1) building blocks for emerging technologies, their scalability and adoption in larger systems, including integration with traditional technologies, (2) modeling, design and optimization of novel devices and systems, (3) models of computation, algorithm design and programming for emerging technologies.", "key": "15", "isLeaf": true, "level": 2}, {"title": "Formal Languages and Automata Theory", "id": "cs.FL", "description": "Covers automata theory, formal language theory, grammars, and combinatorics on words. This roughly corresponds to ACM Subject Classes F.1.1, and F.4.3. Papers dealing with computational complexity should go to cs.CC; papers dealing with logic should go to cs.LO.", "key": "16", "isLeaf": true, "level": 2}, {"title": "General Literature", "id": "cs.GL", "description": "Covers introductory material, survey material, predictions of future trends, biographies, and miscellaneous computer-science related material. Roughly includes all of ACM Subject Class A, except it does not include conference proceedings (which will be listed in the appropriate subject area).", "key": "17", "isLeaf": true, "level": 2}, {"title": "Graphics", "id": "cs.GR", "description": "Covers all aspects of computer graphics. Roughly includes material in all of ACM Subject Class I.3, except that I.3.5 is is likely to have Computational Geometry as the primary subject area.", "key": "18", "isLeaf": true, "level": 2}, {"title": "Computer Science and Game Theory", "id": "cs.GT", "description": "Covers all theoretical and applied aspects at the intersection of computer science and game theory, including work in mechanism design, learning in games (which may overlap with Learning), foundations of agent modeling in games (which may overlap with Multiagent systems), coordination, specification and formal methods for non-cooperative computational environments. The area also deals with applications of game theory to areas such as electronic commerce.", "key": "19", "isLeaf": true, "level": 2}, {"title": "Human-Computer Interaction", "id": "cs.HC", "description": "Covers human factors, user interfaces, and collaborative computing. Roughly includes material in ACM Subject Classes H.1.2 and all of H.5, except for H.5.1, which is more likely to have Multimedia as the primary subject area.", "key": "20", "isLeaf": true, "level": 2}, {"title": "Information Retrieval", "id": "cs.IR", "description": "Covers indexing, dictionaries, retrieval, content and analysis. Roughly includes material in ACM Subject Classes H.3.0, H.3.1, H.3.2, H.3.3, and H.3.4.", "key": "21", "isLeaf": true, "level": 2}, {"title": "Information Theory", "id": "cs.IT", "description": "Covers theoretical and experimental aspects of information theory and coding. Includes material in ACM Subject Class E.4 and intersects with H.1.1.", "key": "22", "isLeaf": true, "level": 2}, {"title": "Machine Learning", "id": "cs.LG", "description": "Papers on all aspects of machine learning research (supervised, unsupervised, reinforcement learning, bandit problems, and so on) including also robustness, explanation, fairness, and methodology. cs.LG is also an appropriate primary category for applications of machine learning methods.", "key": "23", "isLeaf": true, "level": 2}, {"title": "Logic in Computer Science", "id": "cs.LO", "description": "Covers all aspects of logic in computer science, including finite model theory, logics of programs, modal logic, and program verification. Programming language semantics should have Programming Languages as the primary subject area. Roughly includes material in ACM Subject Classes D.2.4, F.3.1, F.4.0, F.4.1, and F.4.2; some material in F.4.3 (formal languages) may also be appropriate here, although Computational Complexity is typically the more appropriate subject area.", "key": "24", "isLeaf": true, "level": 2}, {"title": "Multiagent Systems", "id": "cs.MA", "description": "Covers multiagent systems, distributed artificial intelligence, intelligent agents, coordinated interactions. and practical applications. Roughly covers ACM Subject Class I.2.11.", "key": "25", "isLeaf": true, "level": 2}, {"title": "Multimedia", "id": "cs.MM", "description": "Roughly includes material in ACM Subject Class H.5.1.", "key": "26", "isLeaf": true, "level": 2}, {"title": "Mathematical Software", "id": "cs.MS", "description": "Roughly includes material in ACM Subject Class G.4.", "key": "27", "isLeaf": true, "level": 2}, {"title": "Numerical Analysis", "id": "cs.NA", "description": "cs.NA is an alias for math.NA. Roughly includes material in ACM Subject Class G.1.", "key": "28", "isLeaf": true, "level": 2}, {"title": "Neural and Evolutionary Computing", "id": "cs.NE", "description": "Covers neural networks, connectionism, genetic algorithms, artificial life, adaptive behavior. Roughly includes some material in ACM Subject Class C.1.3, I.2.6, I.5.", "key": "29", "isLeaf": true, "level": 2}, {"title": "Networking and Internet Architecture", "id": "cs.NI", "description": "Covers all aspects of computer communication networks, including network architecture and design, network protocols, and internetwork standards (like TCP/IP). Also includes topics, such as web caching, that are directly relevant to Internet architecture and performance. Roughly includes all of ACM Subject Class C.2 except C.2.4, which is more likely to have Distributed, Parallel, and Cluster Computing as the primary subject area.", "key": "30", "isLeaf": true, "level": 2}, {"title": "Other Computer Science", "id": "cs.OH", "description": "This is the classification to use for documents that do not fit anywhere else.", "key": "31", "isLeaf": true, "level": 2}, {"title": "Operating Systems", "id": "cs.OS", "description": "Roughly includes material in ACM Subject Classes D.4.1, D.4.2., D.4.3, D.4.4, D.4.5, D.4.7, and D.4.9.", "key": "32", "isLeaf": true, "level": 2}, {"title": "Performance", "id": "cs.PF", "description": "Covers performance measurement and evaluation, queueing, and simulation. Roughly includes material in ACM Subject Classes D.4.8 and K.6.2.", "key": "33", "isLeaf": true, "level": 2}, {"title": "Programming Languages", "id": "cs.PL", "description": "Covers programming language semantics, language features, programming approaches (such as object-oriented programming, functional programming, logic programming). Also includes material on compilers oriented towards programming languages; other material on compilers may be more appropriate in Architecture (AR). Roughly includes material in ACM Subject Classes D.1 and D.3.", "key": "34", "isLeaf": true, "level": 2}, {"title": "Robotics", "id": "cs.RO", "description": "Roughly includes material in ACM Subject Class I.2.9.", "key": "35", "isLeaf": true, "level": 2}, {"title": "Symbolic Computation", "id": "cs.SC", "description": "Roughly includes material in ACM Subject Class I.1.", "key": "36", "isLeaf": true, "level": 2}, {"title": "Sound", "id": "cs.SD", "description": "Covers all aspects of computing with sound, and sound as an information channel. Includes models of sound, analysis and synthesis, audio user interfaces, sonification of data, computer music, and sound signal processing. Includes ACM Subject Class H.5.5, and intersects with H.1.2, H.5.1, H.5.2, I.2.7, I.5.4, I.6.3, J.5, K.4.2.", "key": "37", "isLeaf": true, "level": 2}, {"title": "Software Engineering", "id": "cs.SE", "description": "Covers design tools, software metrics, testing and debugging, programming environments, etc. Roughly includes material in all of ACM Subject Classes D.2, except that D.2.4 (program verification) should probably have Logics in Computer Science as the primary subject area.", "key": "38", "isLeaf": true, "level": 2}, {"title": "Social and Information Networks", "id": "cs.SI", "description": "Covers the design, analysis, and modeling of social and information networks, including their applications for on-line information access, communication, and interaction, and their roles as datasets in the exploration of questions in these and other domains, including connections to the social and biological sciences. Analysis and modeling of such networks includes topics in ACM Subject classes F.2, G.2, G.3, H.2, and I.2; applications in computing include topics in H.3, H.4, and H.5; and applications at the interface of computing and other disciplines include topics in J.1--J.7. Papers on computer communication systems and network protocols (e.g. TCP/IP) are generally a closer fit to the Networking and Internet Architecture (cs.NI) category.", "key": "39", "isLeaf": true, "level": 2}, {"title": "Systems and Control", "id": "cs.SY", "description": "cs.SY is an alias for eess.SY. This section includes theoretical and experimental research covering all facets of automatic control systems. The section is focused on methods of control system analysis and design using tools of modeling, simulation and optimization. Specific areas of research include nonlinear, distributed, adaptive, stochastic and robust control in addition to hybrid and discrete event systems. Application areas include automotive and aerospace control systems, network control, biological systems, multiagent and cooperative control, robotics, reinforcement learning, sensor networks, control of cyber-physical and energy-related systems, and control of computing systems.", "key": "40", "isLeaf": true, "level": 2}], "key": "41", "level": 1}], "key": "0", "level": 0}, {"title": "Economics", "children": [{"title": "Economics", "id": "Economics", "children": [{"title": "Econometrics", "id": "econ.EM", "description": "Econometric Theory, Micro-Econometrics, Macro-Econometrics, Empirical Content of Economic Relations discovered via New Methods, Methodological Aspects of the Application of Statistical Inference to Economic Data.", "key": "43", "isLeaf": true, "level": 2}, {"title": "General Economics", "id": "econ.GN", "description": "General methodological, applied, and empirical contributions to economics.", "key": "44", "isLeaf": true, "level": 2}, {"title": "Theoretical Economics", "id": "econ.TH", "description": "Includes theoretical contributions to Contract Theory, Decision Theory, Game Theory, General Equilibrium, Growth, Learning and Evolution, Macroeconomics, Market and Mechanism Design, and Social Choice.", "key": "45", "isLeaf": true, "level": 2}], "key": "46", "level": 1}], "key": "42", "level": 0}, {"title": "Electrical Engineering and Systems Science", "children": [{"title": "Electrical Engineering and Systems Science", "id": "Electrical Engineering and Systems Science", "children": [{"title": "Audio and Speech Processing", "id": "eess.AS", "description": "Theory and methods for processing signals representing audio, speech, and language, and their applications. This includes analysis, synthesis, enhancement, transformation, classification and interpretation of such signals as well as the design, development, and evaluation of associated signal processing systems. Machine learning and pattern analysis applied to any of the above areas is also welcome.  Specific topics of interest include: auditory modeling and hearing aids; acoustic beamforming and source localization; classification of acoustic scenes; speaker separation; active noise control and echo cancellation; enhancement; de-reverberation; bioacoustics; music signals analysis, synthesis and modification; music information retrieval;  audio for multimedia and joint audio-video processing; spoken and written language modeling, segmentation, tagging, parsing, understanding, and translation; text mining; speech production, perception, and psychoacoustics; speech analysis, synthesis, and perceptual modeling and coding; robust speech recognition; speaker recognition and characterization; deep learning, online learning, and graphical models applied to speech, audio, and language signals; and implementation aspects ranging from system architecture to fast algorithms.", "key": "48", "isLeaf": true, "level": 2}, {"title": "Image and Video Processing", "id": "eess.IV", "description": "Theory, algorithms, and architectures for the formation, capture, processing, communication, analysis, and display of images, video, and multidimensional signals in a wide variety of applications. Topics of interest include: mathematical, statistical, and perceptual image and video modeling and representation; linear and nonlinear filtering, de-blurring, enhancement, restoration, and reconstruction from degraded, low-resolution or tomographic data; lossless and lossy compression and coding; segmentation, alignment, and recognition; image rendering, visualization, and printing; computational imaging, including ultrasound, tomographic and magnetic resonance imaging; and image and video analysis, synthesis, storage, search and retrieval.", "key": "49", "isLeaf": true, "level": 2}, {"title": "Signal Processing", "id": "eess.SP", "description": "Theory, algorithms, performance analysis and applications of signal and data analysis, including physical modeling, processing, detection and parameter estimation, learning, mining, retrieval, and information extraction. The term \"signal\" includes speech, audio, sonar, radar, geophysical, physiological, (bio-) medical, image, video, and multimodal natural and man-made signals, including communication signals and data. Topics of interest include: statistical signal processing, spectral estimation and system identification; filter design, adaptive filtering / stochastic learning; (compressive) sampling, sensing, and transform-domain methods including fast algorithms; signal processing for machine learning and machine learning for signal processing applications; in-network and graph signal processing; convex and nonconvex optimization methods for signal processing applications; radar, sonar, and sensor array beamforming and direction finding; communications signal processing; low power, multi-core and system-on-chip signal processing; sensing, communication, analysis and optimization for cyber-physical systems such as power grids and the Internet of Things.", "key": "50", "isLeaf": true, "level": 2}, {"title": "Systems and Control", "id": "eess.SY", "description": "This section includes theoretical and experimental research covering all facets of automatic control systems. The section is focused on methods of control system analysis and design using tools of modeling, simulation and optimization. Specific areas of research include nonlinear, distributed, adaptive, stochastic and robust control in addition to hybrid and discrete event systems. Application areas include automotive and aerospace control systems, network control, biological systems, multiagent and cooperative control, robotics, reinforcement learning, sensor networks, control of cyber-physical and energy-related systems, and control of computing systems.", "key": "51", "isLeaf": true, "level": 2}], "key": "52", "level": 1}], "key": "47", "level": 0}, {"title": "Mathematics", "children": [{"title": "Mathematics", "id": "Mathematics", "children": [{"title": "Commutative Algebra", "id": "math.AC", "description": "Commutative rings, modules, ideals, homological algebra, computational aspects, invariant theory, connections to algebraic geometry and combinatorics", "key": "54", "isLeaf": true, "level": 2}, {"title": "Algebraic Geometry", "id": "math.AG", "description": "Algebraic varieties, stacks, sheaves, schemes, moduli spaces, complex geometry, quantum cohomology", "key": "55", "isLeaf": true, "level": 2}, {"title": "Analysis of PDEs", "id": "math.AP", "description": "Existence and uniqueness, boundary conditions, linear and non-linear operators, stability, soliton theory, integrable PDE's, conservation laws, qualitative dynamics", "key": "56", "isLeaf": true, "level": 2}, {"title": "Algebraic Topology", "id": "math.AT", "description": "Homotopy theory, homological algebra, algebraic treatments of manifolds", "key": "57", "isLeaf": true, "level": 2}, {"title": "Classical Analysis and ODEs", "id": "math.CA", "description": "Special functions, orthogonal polynomials, harmonic analysis, ODE's, differential relations, calculus of variations, approximations, expansions, asymptotics", "key": "58", "isLeaf": true, "level": 2}, {"title": "Combinatorics", "id": "math.CO", "description": "Discrete mathematics, graph theory, enumeration, combinatorial optimization, Ramsey theory, combinatorial game theory", "key": "59", "isLeaf": true, "level": 2}, {"title": "Category Theory", "id": "math.CT", "description": "Enriched categories, topoi, abelian categories, monoidal categories, homological algebra", "key": "60", "isLeaf": true, "level": 2}, {"title": "Complex Variables", "id": "math.CV", "description": "Holomorphic functions, automorphic group actions and forms, pseudoconvexity, complex geometry, analytic spaces, analytic sheaves", "key": "61", "isLeaf": true, "level": 2}, {"title": "Differential Geometry", "id": "math.DG", "description": "Complex, contact, Riemannian, pseudo-Riemannian and Finsler geometry, relativity, gauge theory, global analysis", "key": "62", "isLeaf": true, "level": 2}, {"title": "Dynamical Systems", "id": "math.DS", "description": "Dynamics of differential equations and flows, mechanics, classical few-body problems, iterations, complex dynamics, delayed differential equations", "key": "63", "isLeaf": true, "level": 2}, {"title": "Functional Analysis", "id": "math.FA", "description": "Banach spaces, function spaces, real functions, integral transforms, theory of distributions, measure theory", "key": "64", "isLeaf": true, "level": 2}, {"title": "General Mathematics", "id": "math.GM", "description": "Mathematical material of general interest, topics not covered elsewhere", "key": "65", "isLeaf": true, "level": 2}, {"title": "General Topology", "id": "math.GN", "description": "Continuum theory, point-set topology, spaces with algebraic structure, foundations, dimension theory, local and global properties", "key": "66", "isLeaf": true, "level": 2}, {"title": "Group Theory", "id": "math.GR", "description": "Finite groups, topological groups, representation theory, cohomology, classification and structure", "key": "67", "isLeaf": true, "level": 2}, {"title": "Geometric Topology", "id": "math.GT", "description": "Manifolds, orbifolds, polyhedra, cell complexes, foliations, geometric structures", "key": "68", "isLeaf": true, "level": 2}, {"title": "History and Overview", "id": "math.HO", "description": "Biographies, philosophy of mathematics, mathematics education, recreational mathematics, communication of mathematics, ethics in mathematics", "key": "69", "isLeaf": true, "level": 2}, {"title": "Information Theory", "id": "math.IT", "description": "math.IT is an alias for cs.IT. Covers theoretical and experimental aspects of information theory and coding.", "key": "70", "isLeaf": true, "level": 2}, {"title": "K-Theory and Homology", "id": "math.KT", "description": "Algebraic and topological K-theory, relations with topology, commutative algebra, and operator algebras", "key": "71", "isLeaf": true, "level": 2}, {"title": "Logic", "id": "math.LO", "description": "Logic, set theory, point-set topology, formal mathematics", "key": "72", "isLeaf": true, "level": 2}, {"title": "Metric Geometry", "id": "math.MG", "description": "Euclidean, hyperbolic, discrete, convex, coarse geometry, comparisons in Riemannian geometry, symmetric spaces", "key": "73", "isLeaf": true, "level": 2}, {"title": "Mathematical Physics", "id": "math.MP", "description": "math.MP is an alias for math-ph. Articles in this category focus on areas of research that illustrate the application of mathematics to problems in physics, develop mathematical methods for such applications, or provide mathematically rigorous formulations of existing physical theories. Submissions to math-ph should be of interest to both physically oriented mathematicians and mathematically oriented physicists; submissions which are primarily of interest to theoretical physicists or to mathematicians should probably be directed to the respective physics/math categories", "key": "74", "isLeaf": true, "level": 2}, {"title": "Numerical Analysis", "id": "math.NA", "description": "Numerical algorithms for problems in analysis and algebra, scientific computation", "key": "75", "isLeaf": true, "level": 2}, {"title": "Number Theory", "id": "math.NT", "description": "Prime numbers, diophantine equations, analytic number theory, algebraic number theory, arithmetic geometry, Galois theory", "key": "76", "isLeaf": true, "level": 2}, {"title": "Operator Algebras", "id": "math.OA", "description": "Algebras of operators on Hilbert space, C^*-algebras, von Neumann algebras, non-commutative geometry", "key": "77", "isLeaf": true, "level": 2}, {"title": "Optimization and Control", "id": "math.OC", "description": "Operations research, linear programming, control theory, systems theory, optimal control, game theory", "key": "78", "isLeaf": true, "level": 2}, {"title": "Probability", "id": "math.PR", "description": "Theory and applications of probability and stochastic processes: e.g. central limit theorems, large deviations, stochastic differential equations, models from statistical mechanics, queuing theory", "key": "79", "isLeaf": true, "level": 2}, {"title": "Quantum Algebra", "id": "math.QA", "description": "Quantum groups, skein theories, operadic and diagrammatic algebra, quantum field theory", "key": "80", "isLeaf": true, "level": 2}, {"title": "Rings and Algebras", "id": "math.RA", "description": "Non-commutative rings and algebras, non-associative algebras, universal algebra and lattice theory, linear algebra, semigroups", "key": "81", "isLeaf": true, "level": 2}, {"title": "Representation Theory", "id": "math.RT", "description": "Linear representations of algebras and groups, Lie theory, associative algebras, multilinear algebra", "key": "82", "isLeaf": true, "level": 2}, {"title": "Symplectic Geometry", "id": "math.SG", "description": "Hamiltonian systems, symplectic flows, classical integrable systems", "key": "83", "isLeaf": true, "level": 2}, {"title": "Spectral Theory", "id": "math.SP", "description": "Schrodinger operators, operators on manifolds, general differential operators, numerical studies, integral operators, discrete models, resonances, non-self-adjoint operators, random operators/matrices", "key": "84", "isLeaf": true, "level": 2}, {"title": "Statistics Theory", "id": "math.ST", "description": "Applied, computational and theoretical statistics: e.g. statistical inference, regression, time series, multivariate analysis, data analysis, Markov chain Monte Carlo, design of experiments, case studies", "key": "85", "isLeaf": true, "level": 2}], "key": "86", "level": 1}], "key": "53", "level": 0}, {"title": "Physics", "children": [{"title": "Astrophysics", "id": "astro-ph", "children": [{"title": "Cosmology and Nongalactic Astrophysics", "id": "astro-ph.CO", "description": "Phenomenology of early universe, cosmic microwave background, cosmological parameters, primordial element abundances, extragalactic distance scale, large-scale structure of the universe. Groups, superclusters, voids, intergalactic medium. Particle astrophysics: dark energy, dark matter, baryogenesis, leptogenesis, inflationary models, reheating, monopoles, WIMPs, cosmic strings, primordial black holes, cosmological gravitational radiation", "key": "88", "isLeaf": true, "level": 2}, {"title": "Earth and Planetary Astrophysics", "id": "astro-ph.EP", "description": "Interplanetary medium, planetary physics, planetary astrobiology, extrasolar planets, comets, asteroids, meteorites. Structure and formation of the solar system", "key": "89", "isLeaf": true, "level": 2}, {"title": "Astrophysics of Galaxies", "id": "astro-ph.GA", "description": "Phenomena pertaining to galaxies or the Milky Way. Star clusters, HII regions and planetary nebulae, the interstellar medium, atomic and molecular clouds, dust. Stellar populations. Galactic structure, formation, dynamics. Galactic nuclei, bulges, disks, halo. Active Galactic Nuclei, supermassive black holes, quasars. Gravitational lens systems. The Milky Way and its contents", "key": "90", "isLeaf": true, "level": 2}, {"title": "High Energy Astrophysical Phenomena", "id": "astro-ph.HE", "description": "Cosmic ray production, acceleration, propagation, detection. Gamma ray astronomy and bursts, X-rays, charged particles, supernovae and other explosive phenomena, stellar remnants and accretion systems, jets, microquasars, neutron stars, pulsars, black holes", "key": "91", "isLeaf": true, "level": 2}, {"title": "Instrumentation and Methods for Astrophysics", "id": "astro-ph.IM", "description": "Detector and telescope design, experiment proposals. Laboratory Astrophysics. Methods for data analysis, statistical methods. Software, database design", "key": "92", "isLeaf": true, "level": 2}, {"title": "Solar and Stellar Astrophysics", "id": "astro-ph.SR", "description": "White dwarfs, brown dwarfs, cataclysmic variables. Star formation and protostellar systems, stellar astrobiology, binary and multiple systems of stars, stellar evolution and structure, coronas. Central stars of planetary nebulae. Helioseismology, solar neutrinos, production and detection of gravitational radiation from stellar systems", "key": "93", "isLeaf": true, "level": 2}], "key": "94", "level": 1}, {"title": "Condensed Matter", "id": "cond-mat", "children": [{"title": "Disordered Systems and Neural Networks", "id": "cond-mat.dis-nn", "description": "Glasses and spin glasses; properties of random, aperiodic and quasiperiodic systems; transport in disordered media; localization; phenomena mediated by defects and disorder; neural networks", "key": "95", "isLeaf": true, "level": 2}, {"title": "Mesoscale and Nanoscale Physics", "id": "cond-mat.mes-hall", "description": "Semiconducting nanostructures: quantum dots, wires, and wells. Single electronics, spintronics, 2d electron gases, quantum Hall effect, nanotubes, graphene, plasmonic nanostructures", "key": "96", "isLeaf": true, "level": 2}, {"title": "Materials Science", "id": "cond-mat.mtrl-sci", "description": "Techniques, synthesis, characterization, structure.  Structural phase transitions, mechanical properties, phonons. Defects, adsorbates, interfaces", "key": "97", "isLeaf": true, "level": 2}, {"title": "Other Condensed Matter", "id": "cond-mat.other", "description": "Work in condensed matter that does not fit into the other cond-mat classifications", "key": "98", "isLeaf": true, "level": 2}, {"title": "Quantum Gases", "id": "cond-mat.quant-gas", "description": "Ultracold atomic and molecular gases, Bose-Einstein condensation, Feshbach resonances, spinor condensates, optical lattices, quantum simulation with cold atoms and molecules, macroscopic interference phenomena", "key": "99", "isLeaf": true, "level": 2}, {"title": "Soft Condensed Matter", "id": "cond-mat.soft", "description": "Membranes, polymers, liquid crystals, glasses, colloids, granular matter", "key": "100", "isLeaf": true, "level": 2}, {"title": "Statistical Mechanics", "id": "cond-mat.stat-mech", "description": "Phase transitions, thermodynamics, field theory, non-equilibrium phenomena, renormalization group and scaling, integrable models, turbulence", "key": "101", "isLeaf": true, "level": 2}, {"title": "Strongly Correlated Electrons", "id": "cond-mat.str-el", "description": "Quantum magnetism, non-Fermi liquids, spin liquids, quantum criticality, charge density waves, metal-insulator transitions", "key": "102", "isLeaf": true, "level": 2}, {"title": "Superconductivity", "id": "cond-mat.supr-con", "description": "Superconductivity: theory, models, experiment.  Superflow in helium", "key": "103", "isLeaf": true, "level": 2}], "key": "104", "level": 1}, {"title": "General Relativity and Quantum Cosmology", "id": "gr-qc", "children": [{"title": "General Relativity and Quantum Cosmology", "id": "gr-qc", "description": "General Relativity and Quantum Cosmology Areas of gravitational physics, including experiments and observations related to the detection and interpretation of gravitational waves, experimental tests of gravitational theories, computational general relativity, relativistic astrophysics, solutions to Einstein's equations and their properties, alternative theories of gravity, classical and quantum cosmology, and quantum gravity.", "key": "105", "isLeaf": true, "level": 2}], "key": "106", "level": 1}, {"title": "High Energy Physics - Experiment", "id": "hep-ex", "children": [{"title": "High Energy Physics - Experiment", "id": "hep-ex", "description": "Results from high-energy/particle physics experiments and prospects for future experimental results, including tests of the standard model, measurements of standard model parameters, searches for physics beyond the standard model, and astroparticle physics experimental results. Does not include: detectors and instrumentation nor analysis methods to conduct experiments.", "key": "107", "isLeaf": true, "level": 2}], "key": "108", "level": 1}, {"title": "High Energy Physics - Lattice", "id": "hep-lat", "children": [{"title": "High Energy Physics - Lattice", "id": "hep-lat", "description": "Lattice field theory. Phenomenology from lattice field theory. Algorithms for lattice field theory.  Hardware for lattice field theory.", "key": "109", "isLeaf": true, "level": 2}], "key": "110", "level": 1}, {"title": "High Energy Physics - Phenomenology", "id": "hep-ph", "children": [{"title": "High Energy Physics - Phenomenology", "id": "hep-ph", "description": "Theoretical particle physics and its interrelation with experiment. Prediction of particle physics observables: models, effective field theories, calculation techniques. Particle physics: analysis of theory through experimental results.", "key": "111", "isLeaf": true, "level": 2}], "key": "112", "level": 1}, {"title": "High Energy Physics - Theory", "id": "hep-th", "children": [{"title": "High Energy Physics - Theory", "id": "hep-th", "description": "Formal aspects of quantum field theory. String theory, supersymmetry and supergravity.", "key": "113", "isLeaf": true, "level": 2}], "key": "114", "level": 1}, {"title": "Mathematical Physics", "id": "math-ph", "children": [{"title": "Mathematical Physics", "id": "math-ph", "description": "Articles in this category focus on areas of research that illustrate the application of mathematics to problems in physics, develop mathematical methods for such applications, or provide mathematically rigorous formulations of existing physical theories. Submissions to math-ph should be of interest to both physically oriented mathematicians and mathematically oriented physicists; submissions which are primarily of interest to theoretical physicists or to mathematicians should probably be directed to the respective physics/math categories", "key": "115", "isLeaf": true, "level": 2}], "key": "116", "level": 1}, {"title": "Nonlinear Sciences", "id": "nlin", "children": [{"title": "Adaptation and Self-Organizing Systems", "id": "nlin.AO", "description": "Adaptation, self-organizing systems, statistical physics, fluctuating systems, stochastic processes, interacting particle systems, machine learning", "key": "117", "isLeaf": true, "level": 2}, {"title": "Chaotic Dynamics", "id": "nlin.CD", "description": "Dynamical systems, chaos, quantum chaos, topological dynamics, cycle expansions, turbulence, propagation", "key": "118", "isLeaf": true, "level": 2}, {"title": "Cellular Automata and Lattice Gases", "id": "nlin.CG", "description": "Computational methods, time series analysis, signal processing, wavelets, lattice gases", "key": "119", "isLeaf": true, "level": 2}, {"title": "Pattern Formation and Solitons", "id": "nlin.PS", "description": "Pattern formation, coherent structures, solitons", "key": "120", "isLeaf": true, "level": 2}, {"title": "Exactly Solvable and Integrable Systems", "id": "nlin.SI", "description": "Exactly solvable systems, integrable PDEs, integrable ODEs, Painleve analysis, integrable discrete maps, solvable lattice models, integrable quantum systems", "key": "121", "isLeaf": true, "level": 2}], "key": "122", "level": 1}, {"title": "Nuclear Experiment", "id": "nucl-ex", "children": [{"title": "Nuclear Experiment", "id": "nucl-ex", "description": "Nuclear Experiment Results from experimental nuclear physics including the areas of fundamental interactions, measurements at low- and medium-energy, as well as relativistic heavy-ion collisions.  Does not include: detectors and instrumentation nor analysis methods to conduct experiments; descriptions of experimental programs (present or future); comments on published results", "key": "123", "isLeaf": true, "level": 2}], "key": "124", "level": 1}, {"title": "Nuclear Theory", "id": "nucl-th", "children": [{"title": "Nuclear Theory", "id": "nucl-th", "description": "Nuclear Theory Theory of nuclear structure covering wide area from models of hadron structure to neutron stars. Nuclear equation of states at different external conditions. Theory of nuclear reactions including heavy-ion reactions at low and high energies. It does not include problems of data analysis, physics of nuclear reactors, problems of safety, reactor construction", "key": "125", "isLeaf": true, "level": 2}], "key": "126", "level": 1}, {"title": "Physics", "id": "physics", "children": [{"title": "Accelerator Physics", "id": "physics.acc-ph", "description": "Accelerator theory and simulation. Accelerator technology. Accelerator experiments. Beam Physics. Accelerator design and optimization. Advanced accelerator concepts. Radiation sources including synchrotron light sources and free electron lasers. Applications of accelerators.", "key": "127", "isLeaf": true, "level": 2}, {"title": "Atmospheric and Oceanic Physics", "id": "physics.ao-ph", "description": "Atmospheric and oceanic physics and physical chemistry, biogeophysics, and climate science", "key": "128", "isLeaf": true, "level": 2}, {"title": "Applied Physics", "id": "physics.app-ph", "description": "Applications of physics to new technology, including electronic devices, optics, photonics, microwaves, spintronics, advanced materials, metamaterials, nanotechnology, and energy sciences.", "key": "129", "isLeaf": true, "level": 2}, {"title": "Atomic and Molecular Clusters", "id": "physics.atm-clus", "description": "Atomic and molecular clusters, nanoparticles: geometric, electronic, optical, chemical, magnetic properties, shell structure, phase transitions, optical spectroscopy, mass spectrometry, photoelectron spectroscopy, ionization potential, electron affinity, interaction with intense light pulses, electron diffraction, light scattering, ab initio calculations, DFT theory, fragmentation, Coulomb explosion, hydrodynamic expansion.", "key": "130", "isLeaf": true, "level": 2}, {"title": "Atomic Physics", "id": "physics.atom-ph", "description": "Atomic and molecular structure, spectra, collisions, and data. Atoms and molecules in external fields. Molecular dynamics and coherent and optical control. Cold atoms and molecules. Cold collisions. Optical lattices.", "key": "131", "isLeaf": true, "level": 2}, {"title": "Biological Physics", "id": "physics.bio-ph", "description": "Molecular biophysics, cellular biophysics, neurological biophysics, membrane biophysics, single-molecule biophysics, ecological biophysics, quantum phenomena in biological systems (quantum biophysics), theoretical biophysics, molecular dynamics/modeling and simulation, game theory, biomechanics, bioinformatics, microorganisms, virology, evolution, biophysical methods.", "key": "132", "isLeaf": true, "level": 2}, {"title": "Chemical Physics", "id": "physics.chem-ph", "description": "Experimental, computational, and theoretical physics of atoms, molecules, and clusters - Classical and quantum description of states, processes, and dynamics; spectroscopy, electronic structure, conformations, reactions, interactions, and phases. Chemical thermodynamics. Disperse systems. High pressure chemistry. Solid state chemistry. Surface and interface chemistry.", "key": "133", "isLeaf": true, "level": 2}, {"title": "Classical Physics", "id": "physics.class-ph", "description": "Newtonian and relativistic dynamics; many particle systems; planetary motions; chaos in classical dynamics. Maxwell's  equations and  dynamics of charged systems and  electromagnetic forces in materials. Vibrating systems such as membranes and cantilevers; optomechanics. Classical waves, including acoustics and elasticity; physics of music and musical instruments. Classical thermodynamics and  heat flow problems.", "key": "134", "isLeaf": true, "level": 2}, {"title": "Computational Physics", "id": "physics.comp-ph", "description": "All aspects of computational science applied to physics.", "key": "135", "isLeaf": true, "level": 2}, {"title": "Data Analysis, Statistics and Probability", "id": "physics.data-an", "description": "Methods, software and hardware for physics data analysis: data processing and storage; measurement methodology; statistical and mathematical aspects such as parametrization and uncertainties.", "key": "136", "isLeaf": true, "level": 2}, {"title": "Physics Education", "id": "physics.ed-ph", "description": "Report of results of a research study, laboratory experience, assessment or classroom practice that represents a way to improve teaching and learning in physics. Also, report on misconceptions of students, textbook errors, and other similar information relative to promoting physics understanding.", "key": "137", "isLeaf": true, "level": 2}, {"title": "Fluid Dynamics", "id": "physics.flu-dyn", "description": "Turbulence, instabilities, incompressible/compressible flows, reacting flows. Aero/hydrodynamics, fluid-structure interactions, acoustics. Biological fluid dynamics, micro/nanofluidics, interfacial phenomena. Complex fluids, suspensions and granular flows, porous media flows. Geophysical flows, thermoconvective and stratified flows. Mathematical and computational methods for fluid dynamics, fluid flow models, experimental techniques.", "key": "138", "isLeaf": true, "level": 2}, {"title": "General Physics", "id": "physics.gen-ph", "description": "Description coming soon", "key": "139", "isLeaf": true, "level": 2}, {"title": "Geophysics", "id": "physics.geo-ph", "description": "Atmospheric physics. Biogeosciences. Computational geophysics. Geographic location. Geoinformatics. Geophysical techniques. Hydrospheric geophysics. Magnetospheric physics. Mathematical geophysics. Planetology. Solar system. Solid earth geophysics. Space plasma physics. Mineral physics. High pressure physics.", "key": "140", "isLeaf": true, "level": 2}, {"title": "History and Philosophy of Physics", "id": "physics.hist-ph", "description": "History and philosophy of all branches of physics, astrophysics, and cosmology, including appreciations of physicists.", "key": "141", "isLeaf": true, "level": 2}, {"title": "Instrumentation and Detectors", "id": "physics.ins-det", "description": "Instrumentation and Detectors for research in natural science, including optical, molecular, atomic, nuclear and particle physics instrumentation and the associated electronics, services, infrastructure and control equipment. ", "key": "142", "isLeaf": true, "level": 2}, {"title": "Medical Physics", "id": "physics.med-ph", "description": "Radiation therapy. Radiation dosimetry. Biomedical imaging modelling.  Reconstruction, processing, and analysis. Biomedical system modelling and analysis. Health physics. New imaging or therapy modalities.", "key": "143", "isLeaf": true, "level": 2}, {"title": "Optics", "id": "physics.optics", "description": "Adaptive optics. Astronomical optics. Atmospheric optics. Biomedical optics. Cardinal points. Collimation. Doppler effect. Fiber optics. Fourier optics. Geometrical optics (Gradient index optics. Holography. Infrared optics. Integrated optics. Laser applications. Laser optical systems. Lasers. Light amplification. Light diffraction. Luminescence. Microoptics. Nano optics. Ocean optics. Optical computing. Optical devices. Optical imaging. Optical materials. Optical metrology. Optical microscopy. Optical properties. Optical signal processing. Optical testing techniques. Optical wave propagation. Paraxial optics. Photoabsorption. Photoexcitations. Physical optics. Physiological optics. Quantum optics. Segmented optics. Spectra. Statistical optics. Surface optics. Ultrafast optics. Wave optics. X-ray optics.", "key": "144", "isLeaf": true, "level": 2}, {"title": "Plasma Physics", "id": "physics.plasm-ph", "description": "Fundamental plasma physics. Magnetically Confined Plasmas (includes magnetic fusion energy research). High Energy Density Plasmas (inertial confinement plasmas, laser-plasma interactions). Ionospheric, Heliophysical, and Astrophysical plasmas (includes sun and solar system plasmas). Lasers, Accelerators, and Radiation Generation. Low temperature plasmas and plasma applications (include dusty plasmas, semiconductor etching, plasma-based nanotechnology, medical applications). Plasma Diagnostics, Engineering and Enabling Technologies (includes fusion reactor design, heating systems, diagnostics, experimental techniques)", "key": "145", "isLeaf": true, "level": 2}, {"title": "Popular Physics", "id": "physics.pop-ph", "description": "Description coming soon", "key": "146", "isLeaf": true, "level": 2}, {"title": "Physics and Society", "id": "physics.soc-ph", "description": "Structure, dynamics and collective behavior of societies and groups (human or otherwise). Quantitative analysis of social networks and other complex networks. Physics and engineering of infrastructure and systems of broad societal impact (e.g., energy grids, transportation networks).", "key": "147", "isLeaf": true, "level": 2}, {"title": "Space Physics", "id": "physics.space-ph", "description": "Space plasma physics. Heliophysics. Space weather. Planetary magnetospheres, ionospheres and magnetotail. Auroras. Interplanetary space. Cosmic rays. Synchrotron radiation. Radio astronomy.", "key": "148", "isLeaf": true, "level": 2}], "key": "149", "level": 1}, {"title": "Quantum Physics", "id": "quant-ph", "children": [{"title": "Quantum Physics", "id": "quant-ph", "description": "Description coming soon", "key": "150", "isLeaf": true, "level": 2}], "key": "151", "level": 1}], "key": "87", "level": 0}, {"title": "Quantitative Biology", "children": [{"title": "Quantitative Biology", "id": "Quantitative Biology", "children": [{"title": "Biomolecules", "id": "q-bio.BM", "description": "DNA, RNA, proteins, lipids, etc.; molecular structures and folding kinetics; molecular interactions; single-molecule manipulation.", "key": "153", "isLeaf": true, "level": 2}, {"title": "Cell Behavior", "id": "q-bio.CB", "description": "Cell-cell signaling and interaction; morphogenesis and development; apoptosis; bacterial conjugation; viral-host interaction; immunology", "key": "154", "isLeaf": true, "level": 2}, {"title": "Genomics", "id": "q-bio.GN", "description": "DNA sequencing and assembly; gene and motif finding; RNA editing and alternative splicing; genomic structure and processes (replication, transcription, methylation, etc); mutational processes.", "key": "155", "isLeaf": true, "level": 2}, {"title": "Molecular Networks", "id": "q-bio.MN", "description": "Gene regulation, signal transduction, proteomics, metabolomics, gene and enzymatic networks", "key": "156", "isLeaf": true, "level": 2}, {"title": "Neurons and Cognition", "id": "q-bio.NC", "description": "Synapse, cortex, neuronal dynamics, neural network, sensorimotor control, behavior, attention", "key": "157", "isLeaf": true, "level": 2}, {"title": "Other Quantitative Biology", "id": "q-bio.OT", "description": "Work in quantitative biology that does not fit into the other q-bio classifications", "key": "158", "isLeaf": true, "level": 2}, {"title": "Populations and Evolution", "id": "q-bio.PE", "description": "Population dynamics, spatio-temporal and epidemiological models, dynamic speciation, co-evolution, biodiversity, foodwebs, aging; molecular evolution and phylogeny; directed evolution; origin of life", "key": "159", "isLeaf": true, "level": 2}, {"title": "Quantitative Methods", "id": "q-bio.QM", "description": "All experimental, numerical, statistical and mathematical contributions of value to biology", "key": "160", "isLeaf": true, "level": 2}, {"title": "Subcellular Processes", "id": "q-bio.SC", "description": "Assembly and control of subcellular structures (channels, organelles, cytoskeletons, capsules, etc.); molecular motors, transport, subcellular localization; mitosis and meiosis", "key": "161", "isLeaf": true, "level": 2}, {"title": "Tissues and Organs", "id": "q-bio.TO", "description": "Blood flow in vessels, biomechanics of bones, electrical waves, endocrine system, tumor growth", "key": "162", "isLeaf": true, "level": 2}], "key": "163", "level": 1}], "key": "152", "level": 0}, {"title": "Quantitative Finance", "children": [{"title": "Quantitative Finance", "id": "Quantitative Finance", "children": [{"title": "Computational Finance", "id": "q-fin.CP", "description": "Computational methods, including Monte Carlo, PDE, lattice and other numerical methods with applications to financial modeling", "key": "165", "isLeaf": true, "level": 2}, {"title": "Economics", "id": "q-fin.EC", "description": "q-fin.EC is an alias for econ.GN. Economics, including micro and macro economics, international economics, theory of the firm, labor economics, and other economic topics outside finance", "key": "166", "isLeaf": true, "level": 2}, {"title": "General Finance", "id": "q-fin.GN", "description": "Development of general quantitative methodologies with applications in finance", "key": "167", "isLeaf": true, "level": 2}, {"title": "Mathematical Finance", "id": "q-fin.MF", "description": "Mathematical and analytical methods of finance, including stochastic, probabilistic and functional analysis, algebraic, geometric and other methods", "key": "168", "isLeaf": true, "level": 2}, {"title": "Portfolio Management", "id": "q-fin.PM", "description": "Security selection and optimization, capital allocation, investment strategies and performance measurement", "key": "169", "isLeaf": true, "level": 2}, {"title": "Pricing of Securities", "id": "q-fin.PR", "description": "Valuation and hedging of financial securities, their derivatives, and structured products", "key": "170", "isLeaf": true, "level": 2}, {"title": "Risk Management", "id": "q-fin.RM", "description": "Measurement and management of financial risks in trading, banking, insurance, corporate and other applications", "key": "171", "isLeaf": true, "level": 2}, {"title": "Statistical Finance", "id": "q-fin.ST", "description": "Statistical, econometric and econophysics analyses with applications to financial markets and economic data", "key": "172", "isLeaf": true, "level": 2}, {"title": "Trading and Market Microstructure", "id": "q-fin.TR", "description": "Market microstructure, liquidity, exchange and auction design, automated trading, agent-based modeling and market-making", "key": "173", "isLeaf": true, "level": 2}], "key": "174", "level": 1}], "key": "164", "level": 0}, {"title": "Statistics", "children": [{"title": "Statistics", "id": "Statistics", "children": [{"title": "Applications", "id": "stat.AP", "description": "Biology, Education, Epidemiology, Engineering, Environmental Sciences, Medical, Physical Sciences, Quality Control, Social Sciences", "key": "176", "isLeaf": true, "level": 2}, {"title": "Computation", "id": "stat.CO", "description": "Algorithms, Simulation, Visualization", "key": "177", "isLeaf": true, "level": 2}, {"title": "Methodology", "id": "stat.ME", "description": "Design, Surveys, Model Selection, Multiple Testing, Multivariate Methods, Signal and Image Processing, Time Series, Smoothing, Spatial Statistics, Survival Analysis, Nonparametric and Semiparametric Methods", "key": "178", "isLeaf": true, "level": 2}, {"title": "Machine Learning", "id": "stat.ML", "description": "Covers machine learning papers (supervised, unsupervised, semi-supervised learning, graphical models, reinforcement learning, bandits, high dimensional inference, etc.) with a statistical or theoretical grounding", "key": "179", "isLeaf": true, "level": 2}, {"title": "Other Statistics", "id": "stat.OT", "description": "Work in statistics that does not fit into the other stat classifications", "key": "180", "isLeaf": true, "level": 2}, {"title": "Statistics Theory", "id": "stat.TH", "description": "stat.TH is an alias for math.ST. Asymptotics, Bayesian Inference, Decision Theory, Estimation, Foundations, Inference, Testing.", "key": "181", "isLeaf": true, "level": 2}], "key": "182", "level": 1}], "key": "175", "level": 0}]